#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_container_cluster.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_cluster" "primary" {
      + addons_config                            = (known after apply)
      + allow_net_admin                          = (known after apply)
      + anonymous_authentication_config          = (known after apply)
      + authenticator_groups_config              = (known after apply)
      + binary_authorization                     = (known after apply)
      + cluster_autoscaling                      = (known after apply)
      + cluster_ipv4_cidr                        = (known after apply)
      + confidential_nodes                       = (known after apply)
      + control_plane_endpoints_config           = (known after apply)
      + cost_management_config                   = (known after apply)
      + database_encryption                      = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + default_snat_status                      = (known after apply)
      + deletion_protection                      = (known after apply)
      + description                              = (known after apply)
      + disable_l4_lb_firewall_reconciliation    = (known after apply)
      + dns_config                               = (known after apply)
      + effective_labels                         = (known after apply)
      + enable_autopilot                         = (known after apply)
      + enable_cilium_clusterwide_network_policy = (known after apply)
      + enable_fqdn_network_policy               = (known after apply)
      + enable_intranode_visibility              = (known after apply)
      + enable_k8s_beta_apis                     = (known after apply)
      + enable_kubernetes_alpha                  = (known after apply)
      + enable_l4_ilb_subsetting                 = (known after apply)
      + enable_legacy_abac                       = (known after apply)
      + enable_multi_networking                  = (known after apply)
      + enable_shielded_nodes                    = (known after apply)
      + enable_tpu                               = (known after apply)
      + endpoint                                 = (known after apply)
      + enterprise_config                        = (known after apply)
      + fleet                                    = (known after apply)
      + gateway_api_config                       = (known after apply)
      + gke_auto_upgrade_config                  = (known after apply)
      + id                                       = (known after apply)
      + identity_service_config                  = (known after apply)
      + in_transit_encryption_config             = (known after apply)
      + initial_node_count                       = (known after apply)
      + ip_allocation_policy                     = (known after apply)
      + label_fingerprint                        = (known after apply)
      + location                                 = "asia-northeast3-a"
      + logging_config                           = (known after apply)
      + logging_service                          = (known after apply)
      + maintenance_policy                       = (known after apply)
      + master_auth                              = (known after apply)
      + master_authorized_networks_config        = (known after apply)
      + master_version                           = (known after apply)
      + mesh_certificates                        = (known after apply)
      + min_master_version                       = (known after apply)
      + monitoring_config                        = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "woohalabs-prod-gke"
      + network                                  = (known after apply)
      + network_performance_config               = (known after apply)
      + network_policy                           = (known after apply)
      + networking_mode                          = (known after apply)
      + node_config                              = (known after apply)
      + node_locations                           = (known after apply)
      + node_pool                                = (known after apply)
      + node_pool_auto_config                    = (known after apply)
      + node_pool_defaults                       = (known after apply)
      + node_version                             = (known after apply)
      + notification_config                      = (known after apply)
      + operation                                = (known after apply)
      + pod_autoscaling                          = (known after apply)
      + private_cluster_config                   = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + rbac_binding_config                      = (known after apply)
      + release_channel                          = (known after apply)
      + remove_default_node_pool                 = (known after apply)
      + resource_labels                          = (known after apply)
      + resource_usage_export_config             = (known after apply)
      + secret_manager_config                    = (known after apply)
      + security_posture_config                  = (known after apply)
      + self_link                                = (known after apply)
      + service_external_ips_config              = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = (known after apply)
      + terraform_labels                         = (known after apply)
      + tpu_ipv4_cidr_block                      = (known after apply)
      + user_managed_keys_config                 = (known after apply)
      + vertical_pod_autoscaling                 = (known after apply)
      + workload_identity_config                 = (known after apply)
    }

  # module.external_secrets.google_project_iam_member.external_secrets_secret_accessor will be created
  + resource "google_project_iam_member" "external_secrets_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:external-secrets-prod@infra-480802.iam.gserviceaccount.com"
      + project = "infra-480802"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.external_secrets.google_service_account.external_secrets will be created
  + resource "google_service_account" "external_secrets" {
      + account_id   = "external-secrets-prod"
      + description  = "Service Account for External Secrets Operator to access Secret Manager"
      + disabled     = false
      + display_name = "External Secrets Operator Service Account for prod"
      + email        = "external-secrets-prod@infra-480802.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:external-secrets-prod@infra-480802.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "infra-480802"
      + unique_id    = (known after apply)
    }

  # module.external_secrets.google_service_account_iam_member.external_secrets_workload_identity will be created
  + resource "google_service_account_iam_member" "external_secrets_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:infra-480802.svc.id.goog[external-secrets-system/external-secrets]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.external_secrets.helm_release.external_secrets will be created
  + resource "helm_release" "external_secrets" {
      + atomic                     = false
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets"
      + namespace                  = "external-secrets-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "certController":
                  "resources":
                    "limits":
                      "memory": "128Mi"
                    "requests":
                      "cpu": "50m"
                      "memory": "64Mi"
                "installCRDs": true
                "resources":
                  "limits":
                    "memory": "256Mi"
                  "requests":
                    "cpu": "100m"
                    "memory": "128Mi"
                "serviceAccount":
                  "create": false
                  "name": "external-secrets"
                "webhook":
                  "resources":
                    "limits":
                      "memory": "128Mi"
                    "requests":
                      "cpu": "50m"
                      "memory": "64Mi"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.9.11"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.external_secrets.kubernetes_namespace.external_secrets will be created
  + resource "kubernetes_namespace" "external_secrets" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "environment" = "prod"
              + "name"        = "external-secrets-system"
            }
          + name             = "external-secrets-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.external_secrets.kubernetes_service_account.external_secrets will be created
  + resource "kubernetes_service_account" "external_secrets" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "external-secrets-prod@infra-480802.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "external-secrets"
          + namespace        = "external-secrets-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = true
      + disable_l4_lb_firewall_reconciliation    = false
      + effective_labels                         = {
          + "goog-terraform-provisioned" = "true"
        }
      + enable_cilium_clusterwide_network_policy = false
      + enable_fqdn_network_policy               = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = (known after apply)
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "asia-northeast3-a"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "woohalabs-prod-gke"
      + network                                  = "projects/infra-480802/global/networks/default"
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "infra-480802"
      + remove_default_node_pool                 = true
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "projects/infra-480802/regions/asia-northeast3/subnetworks/default"
      + terraform_labels                         = {
          + "goog-terraform-provisioned" = "true"
        }
      + tpu_ipv4_cidr_block                      = (known after apply)

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "03:00"
            }
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + workload_identity_config {
          + workload_pool = "infra-480802.svc.id.goog"
        }
    }

  # module.gke.google_container_node_pool.spot_pool_large will be created
  + resource "google_container_node_pool" "spot_pool_large" {
      + cluster                     = "woohalabs-prod-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "asia-northeast3-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "woohalabs-prod-spot-large"
      + name_prefix                 = (known after apply)
      + node_count                  = 0
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "infra-480802"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 3
          + min_node_count  = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb     = 30
          + disk_type        = "pd-standard"
          + effective_taints = (known after apply)
          + image_type       = (known after apply)
          + labels           = {
              + "environment"  = "prod"
              + "machine_size" = "large"
              + "node_type"    = "spot"
            }
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "e2-standard-2"
          + metadata         = (known after apply)
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible      = false
          + service_account  = (known after apply)
          + spot             = true
          + tags             = [
              + "gke-node",
              + "prod",
            ]

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }
    }

  # module.gke.google_container_node_pool.spot_pool_medium will be created
  + resource "google_container_node_pool" "spot_pool_medium" {
      + cluster                     = "woohalabs-prod-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "asia-northeast3-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "woohalabs-prod-spot-medium"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "infra-480802"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 3
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb     = 30
          + disk_type        = "pd-standard"
          + effective_taints = (known after apply)
          + image_type       = (known after apply)
          + labels           = {
              + "environment"  = "prod"
              + "machine_size" = "medium"
              + "node_type"    = "spot"
            }
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "e2-medium"
          + metadata         = (known after apply)
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible      = false
          + service_account  = (known after apply)
          + spot             = true
          + tags             = [
              + "gke-node",
              + "prod",
            ]

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + gke_cluster_endpoint = (sensitive value)
  + gke_cluster_name     = "woohalabs-prod-gke"

```

</details>

---

**To apply this plan, comment:**
- `apply` or `ok` or `terraform apply`

*Pusher: @ggorockee, Action: `pull_request`, Workflow: `GCP Terraform Plan`*